# Задача 1  (Вывести на экран циклом пять строк из нулей, причем каждая строка должна быть пронумерована)

# for i in range(1,6):
#     print(i,0)


# Задача 2  (Пользователь в цикле вводит 10 цифр. Найти количество введеных пользователем цифр 5.)
# define=0
# for i in range(10):
#      a = input('Введите число:')
#      if int(a) == 5:
#        define+=1
# print(define)


# Задача 3  (Найти сумму ряда чисел от 1 до 100. Полученный результат вывести на экран.)

# sum=0
# for i in range(1,101):
#     sum+=i
# print(sum)

# Задача 4  (Найти произведение ряда чисел от 1 до 10. Полученный результат вывести на экран.)

# a=1
# for i in range(1,11):
#     a*=i
# print('Результат',':',a)


# Задача 5  (Вывести цифры числа на каждой строчке.)

# integer_number=[2,3,5,2,1,3]
# for i in list(integer_number):
#     print(i)


# Задача 6  (Найти сумму цифр числа)

# a=1
# b=[1,2,3,4,5,6,7,8,9]
# for i in list(b):
#     a=a+int(i)
# print(a)


# Задача 7  (Найти произведение цифр числа)

# a=1
# b=[3,5,2,7,9,2]
# for i in list(b):
#     a=a*int(i)
# print(a)


# Задача 8   (Дать ответ на вопрос: есть ли среди цифр числа 5?)

# a=list(input('Введите число: '))
# for i in a:
#     if int(i)==5:
#         print('В введенном числе есть цифра 5')
#         break
#     else:
#         print('В введеном числе отсутствует цифра 5')
#         break


# Задача 9  (Найти максимальную цифру в числе)

# a=list(input('Введите число: '))
# b=max(a)
# print('Максимальная цифра в введенном числе : {}'.format(b))


# Задача 10  (Найти количество цифр 5 в числе)

# match=0
# a=list(input('Введите число: '))
# for i in a:
#     if int(i)==5:
#         match+=1
# print('Цифра 5 в введенном числе, встречается {} раз'.format(match))