import random


class Fool:
    deck_list = ['6♠', '6♥', '6♣', '6♦', '7♠', '7♥', '7♣', '7♦',
                 '8♠', '8♥', '8♣', '8♦', '9♠', '9♥', '9♣', '9♦',
                 '10♠', '10♥', '10♣', '10♦', 'J♠', 'J♥', 'J♣', 'J♦',
                 'Q♠', 'Q♥', 'Q♣', 'Q♦', 'K♠', 'K♥', 'K♣', 'K♦',
                 'A♠', 'A♥', 'A♣', 'A♦']

    def mix_deck(self):
        # Перемешка карт
        pass

    def on_hand(self):
        # Выдача карт в начале игры
        pass

    def get_cards(self):
        # Получить дополнительную карту
        pass

if __name__ == '__main__':
